ams/src/Documents/ЗаявкаНаЗакупку/ЗаявкаНаЗакупку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаЗакупку</name>
  <basedOn>Catalog.Партнеры</basedOn>
  <basedOn>Catalog.СоглашенияСПоставщиками</basedOn>
  <basedOn>Catalog.СделкиСКлиентами</basedOn>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <basedOn>Document.ЗаказНаПеремещение</basedOn>
  <basedOn>Document.ЗаказНаСборку</basedOn>
  <basedOn>Document.ИзменениеАссортимента</basedOn>
  <basedOn>Document.ЗаявкаНаВозвратТоваровОтКлиента</basedOn>
  <basedOn>Document.ЗаказНаВнутреннееПотребление</basedOn>
  <registerRecords>AccumulationRegister.ЗапасыИПотребности</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоступлениеОднойДатой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаПоступления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявокНаЗакупку</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦельЗакупки</name>
    <type>
      <types>EnumRef.ЦелиЗакупки</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>НоменклатураПартнера</name>
      <type>
        <types>CatalogRef.НоменклатураКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЖелаемаяДатаПоступления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Соглашение</name>
      <type>
        <types>CatalogRef.СоглашенияСПоставщиками</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦеныПоставщика</name>
      <type>
        <types>CatalogRef.ВидыЦенПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Цена</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджетов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НалогообложениеНДС</name>
      <type>
        <types>EnumRef.ТипыНалогообложенияНДС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Протокол</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыЗаявокНаЗакупку</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/Documents/ЗаявкаНаЗакупку/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если Не Согласован
		И Перечисления.СтатусыЗаявокНаЗакупку.Согласована(Статус)
		И ПраваПользователяПовтИсп.СогласованиеЗаявокНаЗакупку() // Автор может закрыть заявку, но это не будет согласованием.
		И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		// Проверки заполнения пройдены, устанавливается статус "согласования".
		Согласован = Истина;
	КонецЕсли;
	
	ЗаполнитьПустыеЖелаемыеДатыПоступления();
	
	РаботаСПротоколомДокумента.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	НоменклатураСервер.ОкруглитьКоличествоШтучныхТоваров(ЭтотОбъект, РежимЗаписи);
	
	СуммаДокумента = Товары.Выгрузить(Новый Структура("Отменено", Ложь)).Итог("СуммаСНДС");
	
	Если Не ЗначениеЗаполнено(Номер) Тогда
		УстановитьНовыйНомер();
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(Автор) И ЭтоНовый() Тогда
		Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;

	НоменклатураСервер.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ);
	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект,НепроверяемыеРеквизиты,Отказ);
	
	// Склады проверяются только при наличии товаров / тары
	НепроверяемыеРеквизиты.Добавить("Товары.Склад");
	НепроверяемыеРеквизиты.Добавить("Склад");
	ЗакупкиСервер.ПроверитьКорректностьЗаполненияДокументаЗакупки(ЭтотОбъект, Отказ);
	
	НепроверяемыеРеквизиты.Добавить("Товары.Подразделение");
	ОписаниеПроверокПодразделений = Новый Соответствие;
	ОписаниеПроверокПодразделений.Вставить(
		Перечисления.ТипыНоменклатуры.Услуга, 
		НСтр("ru = 'Не указан получатель услуг в строке %1 списка Товары'"));
		
	ОписаниеПроверокПодразделений.Вставить(
		Перечисления.ТипыНоменклатуры.Работа, 
		НСтр("ru = 'Не указан получатель работ в строке %1 списка Товары'"));
		
	Для Каждого КлючиИЗначение Из ОписаниеПроверокПодразделений Цикл
		ЗапасыСервер.ПроверитьЗаполнениеПодразделенияВТабличнойЧасти(
			ЭтотОбъект,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КлючиИЗначение.Ключ),
			КлючиИЗначение.Значение,
			Отказ);
	КонецЦикла;
	
	ИспользоватьЛимитыБДР = Документы.ЗаявкаНаЗакупку.ИспользоватьЛимитыБДР();
	КонтролироватьЛимитыБДР = ИспользоватьЛимитыБДР
		И Перечисления.СтатусыЗаявокНаЗакупку.Согласована(Статус) // Заявка согласована
		И ЦельЗакупки = Перечисления.ЦелиЗакупки.СобственныеНужды;
	
	Если Не ИспользоватьЛимитыБДР Тогда
		НепроверяемыеРеквизиты.Добавить("ЦельЗакупки");
	КонецЕсли;
	
	Если Не КонтролироватьЛимитыБДР Тогда
		ИменаРеквизитовАналитикЛимитирования = Документы.ЗаявкаНаЗакупку.ИменаРеквизитовАналитикЛимитирования();
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НепроверяемыеРеквизиты, ИменаРеквизитовАналитикЛимитирования);
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	ПараметрыВыбораСтатейИАналитик = Документы.ЗаявкаНаЗакупку.ПараметрыВыбораСтатейИАналитик(ЦельЗакупки);
	ДоходыИРасходыСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, ПараметрыВыбораСтатейИАналитик);
	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = ТекущаяДатаСеанса();
	Протокол.Очистить();
	Комментарий = Неопределено;
	Статус = Перечисления.СтатусыЗаявокНаЗакупку.НаСогласовании;
	ИнициализироватьДокумент(ОбъектКопирования);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	ТребуетсяЗаполнениеПоСтатистике = Истина;
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		ЗаполнитьДокументПоОтбору(ДанныеЗаполнения);
		ТребуетсяЗаполнениеПоСтатистике = Ложь;
	КонецЕсли;
	
	Если ТребуетсяЗаполнениеПоСтатистике Тогда
		ЗаполнениеОбъектовПоСтатистике.ЗаполнитьРеквизитыОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ЗаполнитьДокументПоОтбору(Знач ДанныеЗаполнения)
	
	// Перечень реквизитов, которые нельзя копировать из отбора:
	НезаполняемыеРеквизиты = Новый Массив;
	НезаполняемыеРеквизиты.Добавить("Проведен");
	НезаполняемыеРеквизиты.Добавить("ПометкаУдаления");
	НезаполняемыеРеквизиты.Добавить("Автор");
	НезаполняемыеРеквизиты.Добавить("Статус");
	НезаполняемыеРеквизиты.Добавить("Исполнитель");
	
	ИсключаемыеРеквизиты = Новый Массив;
	Для Каждого НезаполняемыйРеквизит Из НезаполняемыеРеквизиты Цикл
		Если Не ДанныеЗаполнения.Свойство(НезаполняемыйРеквизит) Тогда
			Продолжить;
		КонецЕсли;
		
		ИсключаемыеРеквизиты.Добавить(НезаполняемыйРеквизит);
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ИсключаемыеРеквизиты) Тогда
		ИсключаемыеРеквизиты = СтрСоединить(ИсключаемыеРеквизиты, ", ");
	Иначе
		ИсключаемыеРеквизиты = Неопределено;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,, ИсключаемыеРеквизиты);
	ЗаполнениеОбъектовПоСтатистике.ЗаполнитьРеквизитыОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ДанныеЗаполнения.Свойство("Товары") Тогда
		Товары.Загрузить(ДанныеЗаполнения.Товары);
	КонецЕсли;
	
	ПроверитьЗаполнитьПоступлениеОднойДатой();
	
	Если ДанныеЗаполнения.Свойство("Товары") Тогда //Заполнение из обработки "Обеспечение потребностей".
		
		Если Не ЗначениеЗаполнено(Валюта) Тогда
			Валюта = ДоходыИРасходыСервер.ПолучитьВалютуУправленческогоУчета(Валюта);
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("Исполнитель") Тогда
			Исполнитель = ДанныеЗаполнения.Исполнитель;
		КонецЕсли;
		
		Действия = Новый Структура;
		Действия.Вставить("ЗаполнитьКонтрагентаПартнераПоУмолчанию", Истина);
		
		ПараметрыЗаполненияДоговора = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияДоговораПоУмолчанию();
		ПараметрыЗаполненияДоговора.Организация = Организация;
		ПараметрыЗаполненияДоговора.ВалютаВзаиморасчетов = Валюта;
		ПараметрыЗаполненияДоговора.ТипДоговора = Документы.ЗаявкаНаЗакупку.ДоступныеТипыДоговоров();
		Действия.Вставить("ЗаполнитьДоговорПоУмолчанию", ПараметрыЗаполненияДоговора);
		
		Действия.Вставить("ЗаполнитьНоменклатуруПартнераПоНоменклатуре", Неопределено);
		
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(
			Действия,
			ЗаявкаНаЗакупкуКлиентСервер.ДействияЗаполненияНалогообложенияНДС(ЭтотОбъект),
			Истина);
		
		ТоварыИсточника = ДанныеЗаполнения.Товары; // ТаблицаЗначений
		ПересчитатьСуммыПоСкорректированнымСтавкамНДС = Истина;
		Если ТоварыИсточника.Колонки.Найти("Цена") = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ЗаявкаНаЗакупкуКлиентСервер.ДействияЗаполненияЦены(ЭтотОбъект), Истина);
			ПересчитатьСуммыПоСкорректированнымСтавкамНДС = Ложь; // Расчет цен инициализирует расчет сумм.
		Иначе
			ПересчитатьСуммыПоСкорректированнымСтавкамНДС = Истина;
		КонецЕсли;
		
		// Инициализируем промежуточную таблица с гарантированным составом колонок
		//   и дополняем ее промежуточными колонками расчетов.
		ТаблицаТоваров = Товары.Выгрузить(); 
		ТаблицаТоваров.Колонки.Добавить("ХозяйственнаяОперация", Новый ОписаниеТипов("ПеречислениеСсылка.ХозяйственныеОперации"));
		
		КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ТаблицаТоваров, Действия, КэшированныеЗначения);
		
		Если ПересчитатьСуммыПоСкорректированнымСтавкамНДС
			И ЗначениеЗаполнено(КэшированныеЗначения.ОбработанныеСтроки) Тогда
			
			ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
				КэшированныеЗначения.ОбработанныеСтроки,
				ЗаявкаНаЗакупкуКлиентСервер.ДействияПересчетаСуммы(ЦенаВключаетНДС, Ложь, Истина),
				ТаблицаТоваров,
				КэшированныеЗначения);
			
		КонецЕсли;
		
		Товары.Загрузить(ТаблицаТоваров);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьДокумент(ДанныеЗаполнения)
	
	Автор = Пользователи.ТекущийПользователь();
	
	Если Не ЗначениеЗаполнено(Исполнитель) Тогда
		Исполнитель = Автор;
	КонецЕсли;
	
	Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	Подразделение = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Автор, Подразделение);
	Склад = ЗначениеНастроекПовтИсп.ПолучитьСкладПоУмолчанию(Склад);
	
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Валюта = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Организация);
	КонецЕсли;
	
	Если ДанныеЗаполнения = Неопределено
		Или ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И Не ДанныеЗаполнения.Свойство("Товары") Тогда
		// Документ вводится без предзаполнения ТЧ.
		ПоступлениеОднойДатой = Истина;
	КонецЕсли;
		
	Если Не Документы.ЗаявкаНаЗакупку.ИспользоватьЛимитыБДР() Тогда
		ЦельЗакупки = ЗаявкаНаЗакупкуКлиентСервер.ЦельЗакупкиПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнитьПоступлениеОднойДатой()

	ПоступлениеОднойДатой = Истина;
	Если Товары.Количество() > 0 Тогда

		ДатаПоступления = Товары[0].ЖелаемаяДатаПоступления;
		
		Для Каждого Строка Из Товары Цикл

			Если Строка.ЖелаемаяДатаПоступления <> ДатаПоступления Тогда
				ПоступлениеОднойДатой = Ложь;
			КонецЕсли;
			
		КонецЦикла;

		Если ПоступлениеОднойДатой Тогда
			ЖелаемаяДатаПоступления = ДатаПоступления;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

// По желаемым датам поступления выполняются поиски документов, например, исполнение планов закупки.
Процедура ЗаполнитьПустыеЖелаемыеДатыПоступления()
	
	УстанавливаемаяДата = ТекущаяДатаСеанса();
	ДеньВСекундах = 24 * 60 * 60;
	
	ИмяРеквизитаСрокОтгрузки = "СрокОтгрузки";
	СрокиОтгрузки = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
		Товары.ВыгрузитьКолонку("Соглашение"),
		ИмяРеквизитаСрокОтгрузки);
		
	Для Каждого СтрокаТоваров Из Товары Цикл
		
		Если ЗначениеЗаполнено(СтрокаТоваров.ЖелаемаяДатаПоступления) Тогда
			Продолжить;
		КонецЕсли;
		
		СрокОтгрузки = СрокиОтгрузки.Получить(СтрокаТоваров.Соглашение);
		Если СрокОтгрузки = Неопределено Тогда
			СрокОтгрузки = 0;
		КонецЕсли;
		
		СтрокаТоваров.ЖелаемаяДатаПоступления = УстанавливаемаяДата + ДеньВСекундах * СрокОтгрузки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
